Autodesk.Revit.DB.FaceArray
An array that contains faces.

Autodesk.Revit.DB.FaceArray.Insert(Autodesk.Revit.DB.Face,System.Int32)
System.Int32
Insert the specified face into the array.
item: The face to be inserted into the array.
index: The face will be inserted before this index.
Returns: Returns whether the face was inserted into the array.

Autodesk.Revit.DB.FaceArray.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.FaceArray.ReverseIterator
Autodesk.Revit.DB.FaceArrayIterator
Retrieve a backward moving iterator to the array.
Returns: Returns a backward moving iterator to the array.

Autodesk.Revit.DB.FaceArray.ForwardIterator
Autodesk.Revit.DB.FaceArrayIterator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.FaceArray.Append(Autodesk.Revit.DB.Face)
void
Add the face to the end of the array.
item: The face to be added.

Autodesk.Revit.DB.FaceArray.Clear
void
Removes every face from the array, rendering it empty.

Autodesk.Revit.DB.FaceArray.Size
System.Int32
get
Returns the number of faces that are in the array.

Autodesk.Revit.DB.FaceArray.Item(System.Int32)
System.Object
Gets or sets a face at a specified index within the array.
index: The index of the face to be set or retrieved.
Returns: Returns the face at the specified index.

Autodesk.Revit.DB.FaceArray.IsEmpty
System.Boolean
get
Test to see if the array is empty.
Remarks: If the array is empty then True will be returned, otherwise False.